##example to read out excel file in same folder

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("students.xlsx")

In [3]:
print("Printing Data Frame as follows: ")

Printing Data Frame as follows:

In [4]:
df

    Name  Age  Marks
0   John   20     85
1  Alice   22     90
2    Bob   21     78
3   Sara   23     92
4   maya   34     34

##example to read out excel file in different folder

In [5]:
patients = pd.read_excel("/Users/aziim/Desktop/AIMLTraining/Day10/ICU_Patient.xlsx")
patients

,patient_id,name,age,arrival_date,departure_date,service,satisfaction
0,PAT-08591375,Garrett Lin,25,2025-02-18,2025-02-25,ICU,76
1,PAT-5b61868c,Ashley Waller,0,2025-05-21,2025-06-04,ICU,82
2,PAT-003ce690,Larry Dixon,29,2025-01-19,2025-01-21,ICU,60
3,PAT-5e3f8747,Elizabeth Kelley,34,2025-03-29,2025-04-12,ICU,91
4,PAT-f70aeea1,Rebecca Jackson,18,2025-02-05,2025-02-18,ICU,77
...,...,...,...,...,...,...,...
236,PAT-110d5794,Travis Hull,48,2025-11-12,2025-11-18,ICU,89
237,PAT-8700b93a,Nicholas Lawrence,9,2025-10-25,2025-11-02,ICU,92
238,PAT-e5d6a9cf,Jacob Santos,76,2025-12-27,2026-01-02,ICU,96
239,PAT-8f07e894,Jennifer James,72,2025-12-12,2025-12-21,ICU,69
240,PAT-4ae301e1,Kara Hernandez,47,2025-02-08,2025-02-20,ICU,61

In [6]:
patients['name']

0            Garrett Lin
1          Ashley Waller
2            Larry Dixon
3       Elizabeth Kelley
4        Rebecca Jackson
             ...
236          Travis Hull
237    Nicholas Lawrence
238         Jacob Santos
239       Jennifer James
240       Kara Hernandez
Name: name, Length: 241, dtype: object

##head in dataframe

In [7]:
patients.head()

,patient_id,name,age,arrival_date,departure_date,service,satisfaction
0,PAT-08591375,Garrett Lin,25,2025-02-18,2025-02-25,ICU,76
1,PAT-5b61868c,Ashley Waller,0,2025-05-21,2025-06-04,ICU,82
2,PAT-003ce690,Larry Dixon,29,2025-01-19,2025-01-21,ICU,60
3,PAT-5e3f8747,Elizabeth Kelley,34,2025-03-29,2025-04-12,ICU,91
4,PAT-f70aeea1,Rebecca Jackson,18,2025-02-05,2025-02-18,ICU,77

In [8]:
df.head()

    Name  Age  Marks
0   John   20     85
1  Alice   22     90
2    Bob   21     78
3   Sara   23     92
4   maya   34     34

In [9]:
print("Print last 2 data")
df.tail(2)

Print last 2 data

   Name  Age  Marks
3  Sara   23     92
4  maya   34     34

In [10]:
patients.tail(5)

,patient_id,name,age,arrival_date,departure_date,service,satisfaction
236,PAT-110d5794,Travis Hull,48,2025-11-12,2025-11-18,ICU,89
237,PAT-8700b93a,Nicholas Lawrence,9,2025-10-25,2025-11-02,ICU,92
238,PAT-e5d6a9cf,Jacob Santos,76,2025-12-27,2026-01-02,ICU,96
239,PAT-8f07e894,Jennifer James,72,2025-12-12,2025-12-21,ICU,69
240,PAT-4ae301e1,Kara Hernandez,47,2025-02-08,2025-02-20,ICU,61

##shape example (row & column)

In [12]:
df.shape

(5, 3)

In [13]:
patients.shape

(241, 7)

In [14]:
r,c = df.shape
print(f'Row: {r} and Column: {r}')

Row: 5 and Column: 5

##values: in dataframe

In [20]:
print("Students Value")
df.values

Students Value

array([['John', 20, 85],
       ['Alice', 22, 90],
       ['Bob', 21, 78],
       ['Sara', 23, 92],
       ['maya', 34, 34]], dtype=object)

In [21]:
print("Patient Value")
patients.values[1]

Patient Value

array(['PAT-5b61868c', 'Ashley Waller', 0, '2025-05-21', '2025-06-04',
       'ICU', 82], dtype=object)